2019/python-selectors.html
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<!-- 2019-03-29 周五 21:53 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Python 高级 I/O 多路复用</title>
<meta name="generator" content="Org mode">
<meta name="author" content="rgb-24bit">

<link rel="stylesheet" type="text/css" href="https://rgb-24bit.github.io/blog/misc/style.css">
<!-- Global site tag (gtag.js) - Google Analytics -->



</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://rgb-24bit.github.io/blog/"> UP </a>
 |
 <a accesskey="H" href="https://rgb-24bit.github.io"> HOME </a>
</div><div id="content">
<h1 class="title">Python 高级 I/O 多路复用</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgbcb08f2">1. 前言</a></li>
<li><a href="#org5c1e877">2. select</a></li>
<li><a href="#org2eec672">3. selectors</a></li>
<li><a href="#orgf299260">4. 结语</a></li>
<li><a href="#org86aca83">5. 参考链接</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgbcb08f2" class="outline-2">
<h2 id="orgbcb08f2"><span class="section-number-2">1</span> 前言</h2>
<div class="outline-text-2" id="text-1">
<p>
第一次接触和 I/O 多路复用相关的概念是在书 CSAPP<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup> 的并发编程章节，当时在了解了这个概念后只是感觉很神奇，但是并没有实际使用过。
</p>

<p>
直到接触了和 <b>异步 I/O</b> 相关的概念，然后才发现，并发和 I/O 这一块的东西还真的有点多。
</p>

<p>
这篇博客的内容算是对 I/O 多路复用的简单介绍以及和 <a href="https://docs.python.org/3/library/selectors.html">selectors</a> 模块的简单使用。
</p>
</div>
</div>

<div id="outline-container-org5c1e877" class="outline-2">
<h2 id="org5c1e877"><span class="section-number-2">2</span> select</h2>
<div class="outline-text-2" id="text-2">
<p>
介绍 I/O 多路复用这个概念往往都是从 <code>select</code> 这个 <b>系统调用</b> 开始的，这篇博客也不例外，但是为了方便，
我们使用的是 Python 提供的 <code>select.select</code> 函数<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>。
</p>

<p>
这个函数的参数列表与返回值是这样的：
</p>
<div class="org-src-container">
<pre class="src src-python">select(rlist, wlist, xlist[, timeout]) -&gt; (rlist, wlist, xlist)
</pre>
</div>

<p>
各个参数的含义：
</p>
<ul class="org-ul">
<li><code>rlist</code> - 等待 <b>可读</b> 事件发生的文件描述符列表</li>
<li><code>wlist</code> - 等待 <b>可写</b> 事件发生的文件描述符列表</li>
<li><code>xlist</code> - 等待 <b>异常</b> 事件发生的文件描述符列表</li>
<li><code>timeout</code> - 可选，指定最长阻塞等待时间</li>
</ul>

<p>
调用这个函数后会 <b>阻塞</b> 等待和各个的文件描述符相对应的 I/O 事件发生，然后将准备好的文件描述符返回。
</p>

<p>
I/O 多路复用的基本模型就和这个函数一样，都是通过一定的方式监听处理 <b>多个</b> 文件的 I/O 事件，或者说，select 是 I/O 多路复用的一种实现。
</p>

<p>
除了 <code>select</code> 以外，常见的还有 <code>poll</code> 和 <code>epoll</code> 这两个实现，它们背后的基本思想都是一样的，区别主要就在于使用的方便性和效率上。
</p>
</div>
</div>

<div id="outline-container-org2eec672" class="outline-2">
<h2 id="org2eec672"><span class="section-number-2">3</span> selectors</h2>
<div class="outline-text-2" id="text-3">
<p>
<code>selectors</code> 模块是对 <code>select</code> 的一层封装，能够让我们以更方便的方式来使用 I/O 多路复用。
</p>

<p>
简单的使用流程为：
</p>
<ol class="org-ol">
<li><p>
通过 <code>selectors.DefaultSelector()</code> 创建默认的 <code>selector</code>
</p>

<p>
当然还存在其他不同种类的 <code>Selector</code>, 但是不同种类的 <code>Selector</code> 的受支持情况在不同的平台上存在差异，
因此大多数时候使用 <code>DefaultSelector</code> 就可以了，它是相应平台上最有效的 <code>Selector</code> 的易名。
</p></li>

<li><p>
通过 <code>selector.register(fileobj, events, data=None)</code> 方法注册需要监听的 <b>文件描述符</b> 或 <b>文件对象</b>
</p>

<p>
可以看到，在使用 <code>selector</code> 时我们可以注册 <b>文件对象</b> 而不一定必须要是 <b>文件描述符</b><sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup>，这为我们的使用带来了一定的便利。
</p>

<p>
对于参数 <code>events</code>, 在 <code>selectors</code> 模块中定义的事件只有 <code>EVENT_READ</code> 和 <code>EVENT_WRITE</code>, 刨除了不太常用的 <b>异常</b> 事件。
</p>

<p>
如果要同时注册两个事件可以像这样：
</p>
<div class="org-src-container">
<pre class="src src-python">selector.register(fileobj, EVENT_READ | EVENT_WRITE)
</pre>
</div></li>

<li><p>
调用 <code>selector.select(timeout=None)</code> 方法监听并获取发生了的 <b>键 - 事件</b> 对列表
</p>

<p>
这里的键是指 <code>SelectorKey</code> 对象，它的属性包括：
</p>
<ul class="org-ul">
<li><code>fileobj</code> - 我们注册的文件对象</li>
<li><code>fd</code> - 我们注册的文件对象的文件描述符</li>
<li><code>events</code> - 我们注册的事件</li>
<li><code>data</code> - 注册时的 <code>data</code> 参数</li>
</ul></li>

<li><p>
处理得到的 <b>键 - 事件</b> 对列表
</p>

<p>
如果注册了不同类型的事件，处理时可以通过返回的事件类型进行处理。
</p>

<p>
同时，我们可以在注册时通过 <code>data</code> 参数附带回调函数，方便处理。
</p></li>
</ol>

<p>
下面是官网的例子：
</p>
<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">import</span> selectors
<span class="org-keyword">import</span> socket

<span class="org-variable-name">sel</span> = selectors.DefaultSelector()

<span class="org-keyword">def</span> <span class="org-function-name">accept</span>(sock, mask):
    <span class="org-variable-name">conn</span>, <span class="org-variable-name">addr</span> = sock.accept()  <span class="org-comment-delimiter"># </span><span class="org-comment">Should be ready</span>
    <span class="org-keyword">print</span>(<span class="org-string">'accepted'</span>, conn, <span class="org-string">'from'</span>, addr)
    conn.setblocking(<span class="org-constant">False</span>)
    sel.register(conn, selectors.EVENT_READ, read)

<span class="org-keyword">def</span> <span class="org-function-name">read</span>(conn, mask):
    <span class="org-variable-name">data</span> = conn.recv(1000)  <span class="org-comment-delimiter"># </span><span class="org-comment">Should be ready</span>
    <span class="org-keyword">if</span> data:
        <span class="org-keyword">print</span>(<span class="org-string">'echoing'</span>, <span class="org-builtin">repr</span>(data), <span class="org-string">'to'</span>, conn)
        conn.send(data)  <span class="org-comment-delimiter"># </span><span class="org-comment">Hope it won't block</span>
    <span class="org-keyword">else</span>:
        <span class="org-keyword">print</span>(<span class="org-string">'closing'</span>, conn)
        sel.unregister(conn)
        conn.close()

<span class="org-variable-name">sock</span> = socket.socket()
sock.bind((<span class="org-string">'localhost'</span>, 1234))
sock.listen(100)
sock.setblocking(<span class="org-constant">False</span>)
sel.register(sock, selectors.EVENT_READ, accept)

<span class="org-keyword">while</span> <span class="org-constant">True</span>:
    <span class="org-variable-name">events</span> = sel.select()
    <span class="org-keyword">for</span> key, mask <span class="org-keyword">in</span> events:
        <span class="org-variable-name">callback</span> = key.data
        callback(key.fileobj, mask)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf299260" class="outline-2">
<h2 id="orgf299260"><span class="section-number-2">4</span> 结语</h2>
<div class="outline-text-2" id="text-4">
<p>
虽然接触 I/O 多路复用已经有一段时间了，但是还没有遇到过需要使用的地方……
</p>

<p>
或者说需要使用的地方已经被相关类库的作者封装好了，没自己什么事了 @_@
</p>

<p>
但是，掌握相关的概念还是很有价值的。
</p>
</div>
</div>

<div id="outline-container-org86aca83" class="outline-2">
<h2 id="org86aca83"><span class="section-number-2">5</span> 参考链接</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li><a href="https://docs.python.org/3/library/selectors.html">selectors — High-level I/O multiplexing — Python 3.7.3 documentation</a></li>
<li><a href="https://github.com/python/cpython/blob/3.7/Lib/selectors.py">cpython/selectors.py at 3.7 · python/cpython</a></li>
</ul>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">&#33050;&#27880;: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="http://csapp.cs.cmu.edu">Computer Systems: A Programmer's Perspective, 3/E (CS:APP3e)</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
C 语言版可以参考 <a href="https://en.wikipedia.org/wiki/Select_(Unix)">select - Wikipedia</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3">3</a></sup> <div class="footpara"><p class="footpara">
文件描述符可以通过文件对象的 <code>fileno()</code> 方法获取
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
版权声明：本作品采用<a rel="license" href="http://creativecommons.org/licenses/by-nc/4.0/">知识共享署名-非商业性使用 4.0 国际许可协议</a>进行许可
<div id="disqus_thread"></div>
<script type="text/javascript">
  var disqus_shortname = 'rgb-24bit';
  (function() {
    var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
  })();
</script>
</div>
</body>
</html>
